; ----------------------------------------------------------------------------
;
; Universal Extractor Language File
; Written for Universal Extractor 1.6
; Author:	Jared Breland <jbreland@legroom.net>
; Homepage:	http://www.legroom.net/mysoft
; french language : jacklours@gmail.com
; Translation Instructions:
;	Copy this file to a new file named after the new language
;		Eg: A language file for the German language would be named Deutsch.ini.
;	Replace the English words and phrases with their native equivalents,
;		attempting to match the English phrasing and case-sensitivity as
;		closely as possible for the sake of consistency
;	Update the Author and Homepage information at the top of your new language
;		file.  Simply delete the Homepage line if you don't have one.
;	Sauver le fichier en format Unicode (UTF-8) et zippez-le pour prйserver le format
;	E-mail new language files to jbreland@legroom.net for inclusion in main
;		Universal Extractor installer
;
;	The following symbols have special meanings:
;	& - when used in a GUI label or button, it precedes the letter that will
;		be registered as a "hotkey" for that function
;	%n - indicates a newline character, which will be replaced when displayed
;	%t - indicates a tab character, which will be replaced when displayed
;	%s - indicates a string variable that UniExtract will replace when displayed
;		The contents each %s variables is hardocded into UniExtract.
;		The order and number of %s variables is very important and should not
;		be modified.
;
; ----------------------------------------------------------------------------

[UniExtract]
; GUI labels and buttons
OK_BUT = "&OK"
CANCEL_BUT = "A&nnuler"
MAIN_DEST_DIR_LABEL = "&Dossier de destination:"
MAIN_FILE_LABEL = "&Archive/Installeur а extraire:"
MENU_FILE_LABEL = "&Fichier"
MENU_FILE_QUIT_LABEL = "&Quitter"
MENU_EDIT_LABEL = "&Edition"
MENU_EDIT_PREFS_LABEL = "&Prйfйrences"
MENU_HELP_LABEL = "&Aide"
MENU_HELP_WEB_LABEL = "Site &Web %s"
PREFS_TITLE_LABEL = "Prйfйrences"
PREFS_UNIEXTRACT_OPTS_LABEL = "Options Universal Extractor"
PREFS_HISTORY_LABEL = "Conserver un historique"
PREFS_FORMAT_OPTS_LABEL = "Options relatives au format"
PREFS_LANG_LABEL = "&Langage"
PREFS_DEBUG_LABEL = "Dossier &fichier de dйbogage:"
PREFS_WARN_EXECUTE_LABEL = "Avertissement exйcution fichiers"
PREFS_REMOVE_DUPE_LABEL = "&Supprimer fichiers redondants"
PREFS_REMOVE_TEMP_LABEL = "Supprimer les fichiers &temporaires"
PREFS_APPEND_EXT_LABEL = "&Ajouter les extensions manquantes"
METHOD_ADMIN_RADIO = "Installateur administratif %s"
METHOD_EXTRACTION_RADIO = "Extraction %s"
METHOD_HEADER = "Extraction %s"
METHOD_MSI_NOTE_LABEL = "Note"
METHOD_MSI_REQUIRES_LABEL = "Msi2xml requiert"
METHOD_MSI_URL_LABEL = "l'analyseur MSXML 6.0"
METHOD_RADIO_LABEL = "Mйthode d'extraction"
METHOD_SWITCH_RADIO = "Commutateur %s"
METHOD_NOTIS_RADIO = "Pas un InstallShield installeur"
METHOD_TEXT_LABEL = "%s supporte les mйthodes d'extraction suivante pour les packages %s. malheureusement, aucune d'elles n'est fiable а 100%. Si la mйthode par dйfaut ne fonctionne pas, relancez %s et choisissez-en une autre."
METHOD_UNPACKER_RADIO = "Dйcompresseur %s"

; GUI control functions
DOES_NOT_EXIST = "n'existe pas.%n"
EXTRACT_TO = "Extraire vers"
INVALID_DIR_SELECTED =  "%s n'est pas un rйpertoire valide."
INVALID_FILE_SELECTED = "%sSйlectionner un fichier valide."
OPEN_FILE = "Ouvrir fichier"
SELECT_FILE = "Sйlectionner fichier"
WRITE_TO = "Crйer dans"

; Common terms
TERM_ARCHIVE = "Archive"
TERM_COMPRESSED = "Fichier compressй"
TERM_DISK = "Disque"
TERM_EBOOK = "Livre йlectronique"
TERM_ECARD = "Carte virtuelle"
TERM_ENCODED = "Fichier encodй"
TERM_EXECUTABLE = "Exйcutable"
TERM_FAILED = "Echec"
TERM_HELP = "Fichier d'aide"
TERM_HOTFIX = "Correctif"
TERM_IMAGE = "Image"
TERM_INSTALLER = "Installeur"
TERM_PACKAGE = "Package"
TERM_PATCH = "patch"
TERM_SFX = "Auto-extraction"
TERM_STAGE = "Etape"
TERM_SUCCEEDED = "Succиs"
TERM_TESTING = "Test"
TERM_UNKNOWN = "Inconnu"
TERM_UNPACKED = "dйcompressй"
TERM_UPDATER = "Mettre а jour"

; Status messages
SCANNING_FILE = "Analyse du type de fichier."
SCANNING_EXE = "Analyse du fichier avec %s."
EXTRACTING = "Extraire fichiers de:"
INIT_WAIT = "Attente de l'initialisation de l'installeur.%nPatientez."

; Custom prompts
CONVERT_CDROM = "Les images de CD-ROM %s ne peuvent кtre extraites directement.  %nCette image sera convertie en image ISO, puis extraite.%n%nDйsirez-vous continuer?%nNote: Ce processus prend plusieurs minutes."
CONVERT_CDROM_STAGE1_FAILED = "Erreur:  L'image du CD-ROM ne peut кtre convertie.%nSi c'est une image BIN/CUE, assurez-vous que le fichier CUE est proprement formattй."
CONVERT_CDROM_STAGE2_FAILED = "Erreur:  Une image ISO a йtй crййe de l'image %s, mais ne peut-кtre convertie.%nDйsirez-vous conserver l'image ISO pour analyse future?"
CONVERT_BIN_MISSING = "Erreur: impossble de trouver:%n%s\%s.%s%n%nL'ensemble %s.bin et %s.cue sont nйcйssaire."
INIT_COMPLETE = "Initialisation %s. Quittez l'installeur, puis cliquez sur OK pour continuer."
WISE_MSI_PROMPT = "Note:  Cette mйthode fonctionne seulement avec l'installeur Wise spйcifique de Windows.%nSi l'assistant d'installation Wise dйmarre, attendez simplement l'entrйe, ce fichier%n n'est pas supportй.  Quittez l'installeur, et %s avortera l'extraction.%n%nDйsirez-vous continuer?"
UNPACK_PROMPT = "Ce fichier est packй avec %s, mais ne peut-кtre extrait.%nEn raison d'un type de fichier non supportй, ou parce qu'il n'y a rien а extraire.%n%nDйsirez-vous dйpcompresser ce fichier quand mкme?%n%nNote: Le fichier dйpackй sera nommй:%n%s\%s_unpacked.%s"
UNPACK_FAILED = "Erreur: impossible а dйcompresser%n%s."
WARN_EXECUTE = "Attention:  Pour extraire un fichier de ce type, il doit кtre exйcutй directement.%nSi vous continuez, La commande suivante sera lancйe:%n%n%s%n%nSi vous pensez que ce fichier puisse кtre malveillant, il est prudent de ne pas continuer.%nDйsirez-vous continuer l'extraction?"

; Help text
HELP_SUMMARY = "Extraire fichiers de n'importe quel type d'archive ou d'installeur."
HELP_SYNTAX = "%nUsage:  %s [/Aide | /prйfs] [Nom fichier [destination]]"
HELP_ARGUMENTS = "%n%nArguments supportйs:"
HELP_HELP = "%n     /Aide%t%tAfficher cette information d'aide"
HELP_PREFS = "%n     /prйfs%t%tAjuster les prйfйrences d'UniExtract"
HELP_FILENAME = "%n     Nom fichier%tNom du fichier а extraire"
HELP_DESTINATION = "%n     destination%tRйpertoire dans lequel extraire"
HELP_SUB = "%n%nPassage /sub: au lieu du nom du rйpertoire de destination, dйfinit%n%s comme sous-rйpertoire d'extraction celui indiquй aprиs l'archive."
HELP_EXAMPLE1 = "%n%nExemple:"
HELP_EXAMPLE2 = "%n     %s c:\1\exemple.zip c:\test"
HELP_NOARGS = "%n%nLancer %s sans arguments entraine%nla demande du nom de fichier et le rйpertoire de destination."

; Error messages
CANNOT_LOG = "Les extractions %s ne peuvent кtre consignйes."
CANNOT_DEBUG = "Dossier de sortie du fichier de dйbogage, "%s", est inaccessible.%nVotre dossier temp sera utilisй."
CANNOT_EXTRACT = "%s impossible а extraire.%nLe type de fichier renvoyй est: %s%n%nCliquer sur OK si vous dйsirez analyser le fichier vous mкme, ou sur Annuler pour quitter."
UNKNOWN_EXT = "%s%nA une extension inconnue et ne peut кtre extrait."
INVALID_DIR = "%s%nimpossible а crйer.  Sйlectionner une destination valide."
EXTRACT_FAILED = "%s impossible а extraire.%nIl apparait comme un %s, qui est supportй, mais echec de l'extraction.%nRegardez le fichier log, %s, pour plus amples informations.%n%nCliquer pour voir le fichier log maintenant, ou annuler pour quitter."

[Installer]
; Components page
COMP_DOCS = "Documentation et information licence"
COMP_LANG = "Fichiers langues pour support international"
COMP_ACE = "Prise en charge des fichiers ACE"
COMP_KGB = "Prise en charge des fichiers KGB"
COMP_PEA = "Prise en charge des fichiers Pea"
COMP_SIT = "Prise en charge des fichiers StuffIt"
; Preferences page
PREFS_CAPTION = "Options du programme"
PREFS_DESCRIPTION = "Quelles options d'Universal Extractor dйsirez-vous йtablir?"
PREFS_LABEL1 = "Vous pouvez йtablir les options suivantes pour ajuster l'apparence d'Universal Extractor par dйfaut."
PREFS_LABEL2 = "Ces options peuvent кtre modifiйes aprиs installation par modification d'UniExtract.ini."
LANGUAGE_LABEL = "Langage par dйfaut"
DEBUG_LABEL = "Emplacement du fichier de dйbogage"
APPEND_EXT_LABEL = "&Ajouter extensions fichier manquantes"
HISTORY_LABEL = "&Conserver un historique"
REMOVE_DUPE_LABEL = "Supprimer les fichiers redondants"
REMOVE_TEMP_LABEL = "Supprimer les fichiers &temporaires"
WARN_EXECUTE_LABEL = "Avertir avant d'exйcuter un fichier"

; Tasks page
ASSOCIATE = "Intйgrer au menu contextuel de l'explorateur"
ASSOCIATE_FILES = "Ajouter 'UniExtract - Extraire vers...' au menu contextuel"
ASSOCIATE_HERE = "Ajouter 'UniExtract - Extraire &ici' au menu contextuel"
ASSOCIATE_SUBDIR = "Ajouter 'UniExtract - Extraire dans &sous-dossier' au menu contextuel"
ASSOCIATE_FORCE = "Forcer l'&association avec tous les formats d'archive supportйs"
MODIFY_PATH = "Ajouter Universal Extractor а votre chemin systиme"
DESKTOP_ICON = "Crйer un raccourci sur le bureau"
QUICK_LAUNCH_ICON = "Crйer un raccourci en zone de &Lancement rapide"
SENDTO_ICON = "Crйer un raccourci dans envoyer vers"

; Context Menu integration
EXTRACT_FILES = "UniExtract - Extraire &vers..."
EXTRACT_HERE = "UniExtract - Extraire &ici"
EXTRACT_SUB = "UniExtract - Extraire dans sous-dossier"
